<a href="https://colab.research.google.com/github/ClaudiaGonzalezScanu/aprendiendo_python/blob/main/Pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Importar las librerías

In [ ]:
import pandas as pd 
import numpy as np

Creamos un DataFrame:

In [ ]:
Nombre_Edad = {'Nombre' : ['Juan', 'Ana', 'Pablo', 'Rene', 'Orlando','Marta'], 
               'Edad' : [32, None, 20, 43, 30,35],
               'Puntaje': [9.4,7.1,4.5,5.6,3.2,6.8]} 
df = pd.DataFrame(Nombre_Edad) 
df

    Nombre  Edad  Puntaje
0     Juan  32.0      9.4
1      Ana   NaN      7.1
2    Pablo  20.0      4.5
3     Rene  43.0      5.6
4  Orlando  30.0      3.2
5    Marta  35.0      6.8

Ver los valores de una columna del DataFrame

In [ ]:
df['Nombre']

0       Juan
1        Ana
2      Pablo
3       Rene
4    Orlando
5      Marta
Name: Nombre, dtype: object

Realizar un rebanado (slicing) sobre la columna "Nombre"

In [ ]:
df['Nombre'][0:4]

0     Juan
1      Ana
2    Pablo
3     Rene
Name: Nombre, dtype: object

In [ ]:
df['Nombre'][2:4]

2    Pablo
3     Rene
Name: Nombre, dtype: object

Mostrar una o más columnas de un DataFrame:

In [ ]:
df[['Nombre','Puntaje']]

    Nombre  Puntaje
0     Juan      9.4
1      Ana      7.1
2    Pablo      4.5
3     Rene      5.6
4  Orlando      3.2
5    Marta      6.8

Crear un nuevo DataFrame a partir de las columnas de un DataFrame previamente definido:

In [ ]:
new_df=df[['Nombre','Puntaje']]
new_df

    Nombre  Puntaje
0     Juan      9.4
1      Ana      7.1
2    Pablo      4.5
3     Rene      5.6
4  Orlando      3.2
5    Marta      6.8

Se utiliza el método **iloc** para ver una o varias filas de un DataFrame o para ver un valor determinado dentro del DataFrame (recordar que filas y columnas inician su indexación a partir de cero):

In [ ]:
df.iloc[0:3]

  Nombre  Edad  Puntaje
0   Juan    32      9.4
1    Ana    55      7.1
2  Pablo    20      4.5

In [ ]:
df.iloc[1,2]

7.1

In [ ]:
df.iloc[2,2]

4.5

Filtrar el DataFrame:

In [ ]:
df[(df["Puntaje"]>=6.0)]

  Nombre  Edad  Puntaje
0   Juan  32.0      9.4
1    Ana   NaN      7.1
5  Marta  35.0      6.8

In [ ]:
df[(df["Puntaje"]>=6.0) & (df["Edad"]<40)]

  Nombre  Edad  Puntaje
0   Juan  32.0      9.4
5  Marta  35.0      6.8

Examinar un DataFrame:

In [ ]:
df.describe()

            Edad   Puntaje
count   5.000000  6.000000
mean   32.000000  6.100000
std     8.336666  2.172556
min    20.000000  3.200000
25%    30.000000  4.775000
50%    32.000000  6.200000
75%    35.000000  7.025000
max    43.000000  9.400000

In [ ]:
df.head(2)

  Nombre  Edad  Puntaje
0   Juan  32.0      9.4
1    Ana   NaN      7.1

In [ ]:
df.tail(2)

    Nombre  Edad  Puntaje
4  Orlando  30.0      3.2
5    Marta  35.0      6.8

In [ ]:
df.shape

(6, 3)

In [ ]:
df.columns

Index(['Nombre', 'Edad', 'Puntaje'], dtype='object')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nombre   6 non-null      object
 1   Edad     5 non-null      float64
 2   Puntaje  6 non-null      float64
dtypes: float64(2), object(1)
memory usage: 272.0+ bytes